Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/health_issues.html.txt.tmx
Source language: en
Languages: ga

source: Health issues when travelling abroad
ga: Saincheisteanna sláinte agus tú ag taisteal thar lear

source: More and more Irish citizens are travelling internationally for professional, recreational, social and humanitarian reasons
ga: Tá níos mó is níos mó saoránach Éireannach ag taisteal thar lear ar mhaithe le cúiseanna gairmiúla, siamsaíochta, sóisialta agus daonnachtúla

source: Given we are travelling greater distances and to a wide variety of countries, sometimes this can expose our health to risks in often unfamiliar environments
ga: Ós rud é go mbímid ag taisteal níos faide agus chuig réimse níos leithne tíortha, is féidir leis seo ár sláinte a chur i gcontúirt i dtimpeallachtaí nach bhfuil mórán eolais againn orthu

source: Hopefully, your trip abroad will be free of any health scares, but you need to be prepared to meet every eventuality
ga: Tá súil againn nach mbeidh aon fholáireamh sláinte agat agus tú ar turas thar lear, ach caithfidh tú a bheith ullamh le haghaidh gach cáis

source: Most of the health risks associated with travel, can be minimized by suitable precautions taken before, during and after your trip
ga: Is féidir an chuid is mó de na rioscaí a bhaineann le taisteal a íosmhéadú má ghlactar réamhchúraimí roimh ré, le linn agus i ndiaidh do thurais

source: You should ensure that you have taken every possible precaution and, if the worst comes to the worst, you should be confident that you have organised the necessary insurance to pay for the medical care you require
ga: Ba cheart duit a chinntiú go bhfuil gach réamhchúram déanta agat leis an bhféidearthacht sin a sheachaint agus, má tharlaíonn drochrud ina ainneoin sin, ba chóir duit a bheith muiníneach go bhfuil an t-árachas riachtanach eagraithe agat le híoc as an gcúram míochaine a bheadh de dhíth ort

source: Some key factors in determining risks to your health when travelling abroad include:
ga: Ar na fachtóirí is tábhachtaí maidir le rioscaí don tsláinte a chinneadh agus tú ag Taisteal thar Lear, tá:

source: • destination you are visiting
ga: • an áit a bhfuil tú ag dul chuici

source: Medical advice before you travel
ga: Comhairle míochaine sula dtaistealaíonn tú

source: If you are intending to visit somewhere in a developing country, you should consult with your family doctor (GP) or a travel medicine clinic before the journey
ga: Má tá rún agat cuairt a thabhairt ar áit éigin i dtír i mbéal forbartha, ba chóir duit dul i gcomhairle le do dhochtúir teaghlaigh (GP) nó clinic míocháine taistil roimh an turas

source: This consultation should preferably take place about 8 weeks before the journey, particularly if vaccination(s) may be required
ga: Is inmholta an comhairliú seo a dhéanamh 8 seachtaine roimh an turas, go háirithe má bhíonn vacsaínithe de dhíth

source: Your family doctor or clinic can advise you on this
ga: Is féidir le do dhochtúir teaghlaigh nó le clinic comhairle a thabhairt duit faoin gceist seo

source: Similarly, if you have a pre-existing medical condition that requires ongoing care, or are among an 'at risk' group it is advisable to seek medical advice in advance of your journey
ga: Ar an dóigh chéanna, má tá riocht míochaine ort a bhfuil cúram leanúnach de dhíth air, nó má tá tú i ngrúpa ‘i mbaol’, is inmholta comhairle dochtúra a lorg roimh do thuras

source: If you will be travelling abroad for an extended period, you should consider consulting your doctor to discuss known or possible health risks
ga: Má tá tú ag taisteal thar lear ar feadh tréimhse fada, ba chóir duit comhairliú le do dhochtúir chun rioscaí féideartha sláinte a phlé

source: If you take medication on a regular basis you should ask your doctor to prescribe an amount adequate for your visit and bring it with you
ga: Má thógann tú cógas ar bhonn rialta, ba chóir duit iarraidh ar do dhochtúir méid dóthanach a ordú duit don chuairt agus é a thabhairt leat

source: It is also advisable to bring a letter from your doctor outlining your medical condition and the type of medication you require
ga: Lena chois sin, tugtar comhairle duit litir ó do dhochtúir a thabhairt leat a leagann amach do riocht sláinte agus an cineál cógais atá ag teastáil

source: Vaccinations and immunisations are required in order to travel to certain countries around the world
ga: Tá Vacsaínithe agus imdhíonachtaí de dhíth le taisteal chuig tíortha áirithe timpeall an domhain

source: They should be considered if you are travelling to areas outside of Western Europe, North America, Australia, and New Zealand
ga: Ba cheart duit smaoineamh ar iad a fháil má tá tú ag taisteal chuig limistéir lasmuigh d’Iarthar na hEorpa, Meiriceá Thuaidh, an Astráil agus an Nua-Shéalainn

source: Your family doctor (GP) or travel medicine clinic can advise on your options
ga: Is féidir le do dhochtúir teaghlaigh nó clinic míochaine taistil comhairle a thabhairt duit faoi na roghanna atá agat

source: Travelling within the EU/EEA
ga: Ag taisteal taobh istigh den AE/LEE

source: If you are a EU/EEA citizen and your trip is to a destination within the EEA (the 28 EU member states, Norway Iceland, Liechtenstein) or Switzerland, you are strongly advised to bring along your European Health Insurance Card
ga: Más saoránach de chuid an AE/LEE thú agus má tá do thuras taobh istigh den LEE (na 28 ballstát den AE, an Iorua, an Íoslainn, Liechtenstein) nó an Eilvéis, moltar duit go láidir Cárta Eorpach um Árachas Sláinte, atá saor in aisce a thabhairt leat

source: This Card will cover the cost associated with necessary medical treatment (if required) while you are visiting another member state
ga: Clúdóidh an Cárta seo an costas a bhaineann le cóireáil míochaine riachtanach (más gá) agus tú ar cuairt chuig ballstát eile

source: Travelling outside the EU/EEA
ga: Ag taisteal taobh amuigh den AE/LEE

source: If you will be travelling outside the EU/EEA, you are strongly advised to seek specific holiday or health insurance before you travel
ga: Má tá tú ag dul a bheith lasmuigh den AE/LEE, moltar duit go láidir árachas speisialta saoire nó sláinte a lorg sula n-imíonn tú

source: Insurance rates in Ireland can vary significantly, so shop around for the best value before your trip
ga: Is féidir le rátaí árachais in Éirinn a bheith an-éagsúil agus dá bhrí sin moltar duit taighde a dhéanamh leis an margadh is fearr a fháil roimh do thuras

source: Ireland and Australia have a reciprocal health agreement
ga: Tá comhaontú cómhalartach sláinte idir Éirinn agus an Astráil

source: This means that Irish visitors to Australia will receive emergency services and assistance towards the cost of prescribed drugs and medicines on the same basis as persons ordinarily resident in Australia
ga: Ciallaíonn seo go bhfuil muintir na hÉirinn a thugann cuairt ar Astráile i dteideal seirbhísí éigeandála agus cúnamh a fháil i dtreo costas drugaí agus cógais ordaithe ar an mbonn céanna a bhíonn iad siúd a bhfuil gnáthchónaí orthu in Astráil

source: Depending on what part of the world you are in, insects such as mosquitoes, ticks and sandflies can spread infections such as malaria and yellow fever
ga: Ag brath ar cén chuid den domhan a bhfuil tú i, is féidir le feithidí cosúil mosquitoes, sceartáin agus cuileoga gaineamh ionfhabhtuithe scaipeadh mar maláire agus fiabhras buí sórt sin

source: The HSE website provides information on how to prevent insect bites
ga: Soláthraíonn an láithreán gréasáin FSS faisnéis maidir le conas a greamanna feithidí a chosc

source: The HSE has information on preventing illness and infection while abroad
ga: Tá eolas ar chosc tinneas agus ionfhabhtú agus iad thar lear ag an FSS

source: The Health Protection Surveillance Centre provides advice for travellers on how to avoid illness on its website
ga: Soláthraíonn an Lárionad Faire um Chosaint Sláinte comhairle don lucht siúil maidir le conas tinneas a sheachaint ar a láithreán gréasáin

source: The World Health Organization has provided a very useful site with lots of information and advice regarding health and international travel
ga: Tá suíomh an-úsáideach curtha ar fáil ag an Eagraíocht Sláinte Domhanda a bhfuil a lán faisnéise agus comhairle air maidir le taisteal idirnáisiúnta agus sláinte

source: A little time spent checking out the following information before your trip will also ensure you are well prepared
ga: Lena chinntiú go bhfuil tú ullmhaithe mar is ceart, caith giota beag ama roimh do thuras chomh maith ag seiceáil na faisnéise seo a leanas

source: • What local conditions do I need to be aware of?
ga: • Cad iad na himthosca áitiúla a gcaithfidh mé a bheith ar an eolas fúthu?

source: • Do I need vaccines to prevent illness or health risks?
ga: • An mbeidh vacsaínithe de dhíth orm le tinneas nó rioscaí don tsláinte a sheachaint?

source: • Which authorities do I contact in the event of an accident or incident?
ga: • Cad iad na húdaráis a ndéanfaidh mé teagmháil leo i gcás taisme nó teagmhais?

source: • Do I need any additional medical prescriptions before I travel?
ga: • An mbeidh aon oidis bhreise mhíochaine de dhíth orm roimh imeacht?

source: • What blood group am I?
ga: • Cén grúpa fola lena mbainim?

source: • Do I need a dental/optical/medical check-up before I travel?
ga: • An bhfuil seic fiaclóireachta/radhairc/míochaine de dhíth orm sula n-imím?

source: Your family doctor (GP) or tropical medical bureau can answer some of the above questions
ga: Is feidir le do dhochtúir teaghlaigh nó biúro míochaine tropaicigh cuid de na ceisteanna thuas a fhreagairt

source: It's also sensible (depending on your destination) to check with your dentist/optician whether you may need a check-up before you travel
ga: Is den chiall chomh maith (ag brath ar do cheann scríbe) seiceáil le d’fhiaclóir/radharceolaí lena fháil amach an mbeidh seic de dhíth ort roimh imeacht duit

source: Your travel agent/tour operator/trip organiser should be able to provide information on the local weather, accommodation, health facilities and other conditions before your journey
ga: Ba chóir go mbeadh do ghníomhaire taistil/oibritheoir turas/eagraitheoir turas in ann faisnéis a chur ar fáil faoin aimsir, lóistín, áiseanna sláinte agus imthosca eile san áit a bhfuil tú ag dul roimh do thuras

source: Travel guidebooks are also a good source of information
ga: Is foinse maith eolais iad treoirleabhair taistil chomh maith

source: You can also get in touch with the nearest Embassy or Consulate of the country you will be visiting for more information
ga: Chomh maith leis sin, is féidir leat teagmháil a dhéanamh leis an Ambasáid nó Consalacht is cóngaraí den tír a mbeidh tú ag tabhairt cuairte uirthi le haghaidh tuilleadh faisnéise
